app/Controllers/Admin.php

    public function index()
    {
        $data = [
            'title' => 'Admin Produk',
            'produk' => $this->produkModel
                ->select('produk.*, kategori.nama_kategori')
                ->join(
                    'kategori',
                    'kategori.id_kategori = produk.id_kategori'
                )
                ->findAll()
---
SELECT `produk`.*, `kategori`.`nama_kategori`
FROM `produk`
JOIN `kategori` ON `kategori`.`id_kategori` = `produk`.`id_kategori`