app/Controllers/Home.php

SELECT *
FROM `produk`
---
    public function index()
    {
        $model = new ProdukModel();
        $data = [
            'title' => 'Toko Sederhana Kita',
            'produk' => $model->findAll()